{
  "team": [
    {
      "name": "Richard Robertson",
      "title": "Chief Operating Officer",
      "bio": "Richard Robertson joined Sing for Hope as Chief Operating Officer in 2016. He has an MBA in Nonprofit Arts Administration from Binghamton University and a Bachelor of Social Work from the University of Georgia. He began his nonprofit career in San Diego, working with San Diego Opera, San Diego Repertory Theatre, and the Theatre in Old Town San Diego. Lured by the bright lights of Broadway, he moved to NYC and spent 15 years with Eliran Murphy Group, an advertising agency specializing in arts and culture. He eventually became that company’s COO and led campaigns for Lincoln Center, Roundabout Theatre Company, Big Apple Circus, New Jersey Performing Arts Center, New York City Opera, The Apollo Theatre, American Museum of Natural History, and numerous Broadway and off-Broadway shows. His accomplishments at SFH include overseeing the organization’s expansion beyond New York City to additional American cities, including New Orleans and Beverly Hills / Los Angeles, and the amplification of its education program for youth ages 8-18. In his down time, Richard’s passions include animal rights, veganism, and every possible sort of bad reality television.",
      "img": "richard-robertson.jpg"
    },
    {
      "name": "Michele Aupont",
      "title": "Chief Impact Officer",
      "bio": "Michele C. Aupont is Afro-Latina, born in Haiti to a Cuban father and a Haitian mother. She migrated to Long Island, NY, in 1999. Michele resides in Lakes Spivey, Georgia, with her husband Lloyd, her two beautiful children, Patrick and Oliva, and my five-year-old chocolate Lab, Nila. Michele speaks French, Spanish, Haitian Creole, and, of course, English. She holds a Bachelor of Science in Human Resources Management and has more than a decade of experience in business development and strategic planning. As the former Director of Development at Women Who Code, Michele successfully led initiatives that significantly increased revenue and enhanced operational efficiency while managing cross-functional teams. Michele’s community leadership roles include serving on the Advisory boards of Thrive Unburdened, Inc., Elite Scholars Academy School Council Board, and The Colonel’s Kitchen Board. A creative at heart, Michele enjoys painting. In her spare time, you will find her at a wine-tasting event or experiencing fine cuisine. Ballroom dancing was her foundation for developing emotional intelligence, building confidence, learning to be authentic, and being a great leader or a successful follower.",
      "img": "michele-aupont.jpg"
    },
    {
      "name": "Jennifer Register",
      "title": "Chief of Staff",
      "bio": "Jennifer Register, Sing for Hope's Chief of Staff, brings a diverse background spanning beauty, retail, music education, and bioscience industries. With over 15 years of experience, she combines creative vision with operational expertise to drive the organization's mission forward. As National Operations Manager at School of Rock, Jennifer significantly increased student enrollment and reduced staff turnover, demonstrating her ability to foster thriving creative communities. Her experience streamlining operations in the bioscience industry and leading a multi-state expansion for a cannabis confectionary company resulted in impressive revenue growth, showcasing her talent for optimization and driving results. At Sing for Hope, Jennifer leads strategic initiatives, shapes internal and external communications strategies, and oversees special projects. Her analytical skills, resource management, and collaborative leadership ensure efficient project completion and maximize impact. Jennifer believes in the power of emotional intelligence to drive collaboration and innovation, working to create a workplace environment that is both positive and inclusive. Jennifer's lifelong passion for music and the arts, coupled with her strategic mindset and commitment to social good, make her a valuable asset. She deeply understands the transformative power of the arts and has a proven track record of fostering creativity, community, and positive change. As Chief of Staff, Jennifer is dedicated to expanding Sing for Hope's reach and impact, leveraging her diverse experience to create innovative solutions that bring the healing power of the arts to all communities. She loves Diet Coke.",
      "img": "jennifer-register.jpg"
    },
    {
      "name": "Lis Chirinos",
      "title": "Director of Arts in Public Health",
      "bio": "Lis Chirinos, Director of Arts in Public Health at Sing for Hope, has dedicated over 25 years to producing accessible arts programs. Her previous work includes pivotal roles at Live Music Now, a UK-based organization founded by violinist Yehudi Menuhin to drive social impact through music. Lis contributed to live music interventions across healthcare, special education, and assisted living settings. Her work on the Live Music in Care program enhanced person-centered care, boosted staff confidence in using music as a care tool, and contributed to staff wellbeing and retention. She advanced the growth of Live Music Now's Musicians' Development program, recruiting and training musicians to work effectively with vulnerable populations. Lis' career began in the Programming Department at the New Jersey Performing Arts Cente (NJPAC) and the Newark Arts Council, where she facilitated collaborative and inclusive programming for Newark residents. At NJPAC, she founded Sounds of the City, a free summer concert series that became a cultural cornerstone, bringing diverse performances to thousands in downtown Newark. She later co-founded Red Grasshopper Ltd, an art consultancy in London specializing in festival development, arts intervention research and evaluation, and community engagement. She worked with clients, including Arts Council England and the Greater London Authority, to promote cultural accessibility, creative placemaking, and community development. At Sing for Hope, Lis leads the Public Health and Wellbeing Department, overseeing the Creative Workforce Development program and Creative Placemaking initiative. She holds an MA in Visual Anthropology from Goldsmiths, University of London, and studied Cultural Anthropology and Urban Studies at Rutgers University. Ella habla español y yn dysgu Cymraeg. Outside work, Lis enjoys singing with her community choir, teaching adults English as a second language, and overindulging in Korean dramas.",
      "img": "lis-chirinos.jpg"
    },
    {
      "name": "Javier Hinojosa",
      "title": "Director of Information Technology",
      "bio": "Javier is the Director of Information Technology at Sing for Hope. With over 15 years of experience in the STEM arena, he's finally added an A for Art by serving Sing for Hope's mission of creating a better world through the arts. Javier's role at Sing for Hope comprises the direction, control, development, and maintenance of the organization's information technology and systems. His goal is to facilitate internal operations, make Sing for Hope accessible to anyone and everyone with an internet connection, and uncover opportunities stemming from new advances in technology.",
      "img": "javier-hinojosa.jpg"
    },
    {
      "name": "Sharyn Pirtle",
      "title": "Director of Education",
      "bio": "Sharyn’s “Aha!” moment began in a fantastic public performing arts school in her native Houston, Texas, where children from different socioeconomic backgrounds came to share their passion for the arts. In response to the education gaps in her community, in 2005, Sharyn founded Young at Arts, an arts program for children in need. In 2020, Sharyn led the launch of The Sing for Hope Lab to serve communities of The Bronx and southern Westchester, which had been among the hardest hit by COVID in the nation. Within 4 years, the Sing for Hope Lab has grown from its initial pilot phase into a daily, year-round educational center and as a testing ground for her curriculum, the Sing for Hope  Global Goals Arts Curriculum. The Sing for Hope Global Goals Arts Curriculum uses artistic expression to raise awareness and encourage action on the UN's Global Goals, promoting a global vision for peace and prosperity. Sharyn received her Bachelor’s and Master’s degrees in Vocal Performance from The Eastman School of Music and trained as an opera director at Houston Grand Opera. She has directed numerous operas and musicals professionally and for youth at the Houston Grand Opera, Portland Opera, Lyric Opera of Kansas City, The Wallis Center for the Performing Arts, and the Bard Summer Music Festival. Sharyn and her husband, lighting designer Shawn Kaufman, live in Mount Vernon, NY, and are proud to be the parents of daughter Amélie; dogs Rosey, Taco, and Tuesday; a cat named Moon; and 5 chickens.",
      "img": "sharyn-pirtle.jpg"
    },
    {
      "name": "Patty Reitkopf",
      "title": "Senior Program Strategist",
      "bio": "For over 30 years, Patty has dedicated her career to arts access for underserved and marginalized individuals, primarily with Hospital Audiences, Inc. (HAI, Healing Arts Initiatives), where she held various positions, including Deputy Executive Director. During her tenure at HAI, Patty secured and managed numerous government grants, including grants from the National Endowment of the Arts, Law Enforcement Assistance Administration, HUD, New York State’s Council on the Arts, Department of Health and Mental Hygiene, Department of Corrections, Office of People with Developmental Disabilities, New York City’s Department of Education, Department of Cultural Affairs, Department of Juvenile Justice, and Homeless Services, as well as from private foundations including the ASCAP Foundation, Rockefeller Foundation, and The Fan Fox and Leslie R. Samuels Foundation. Patty holds a Master’s Degree in Forensic Psychology and was a Senior Fellow at Baruch College of Public Aministration’s graduate program. At Sing for Hope, Patty has helped develop, support, and implement our virtual and in-person programming serving older adults, including our NYSCA-funded ReStart NY program for elder care facilities.",
      "img": "patty-reitkopf.jpg"
    },
    {
      "name": "Pamela Weingarden",
      "title": "Director of Donor Relations",
      "bio": "Pamela Weingarden has been with Sing for Hope since 2016. Originally hired to assist with the Sing for Hope Pianos Program, she has since worked in all aspects of the organization, from Healing Arts to Operations to her current role as Development Manager & Board Liaison. Pamela is an actress and musician, and has 12 years of event planning and logistics experience. She has her BFA in acting from New York University's Tisch School of the Arts, and has studied Shakespearean performance at the Royal Academy of Dramatic Art in London.",
      "img": "pamela-weingarden.jpg"
    },
    {
      "name": "China Ziegenbein",
      "title": "Director of Global Partnerships",
      "bio": "China Ziegenbein joined Sing for Hope as Director – Global Partnerships in 2024. A California native, China began her career in the Bay Area working for an economic development organization that united the hospitality and arts communities. After relocating to New York City in 2007, her career focused on integrating public relations and global communications for Fortune 100 brands. China has held prominent development and marketing positions with the World Economic Forum, The Atlantic, Central Park Conservancy and the Tribeca Film Festival. China has a BA in Political Science and Communications from San Jose State University.",
      "img": "china-ziengenbein.jpg"
    },
    {
      "name": "Patrick Freeman",
      "title": "Sing for Hope Pianos Studio Manager",
      "bio": "Patrick Freeman is the Sing for Hope Pianos Studio Manager. Since joining SFH in 2016, Freeman has designed over seven pianos, including collaborations with Lil Nas X, M&M's, Playbill, the \"Rocket Man\" film, and World Piano Day at the Oculus World Trade Center. His vibrant, bold, and whimsical work is characterized by graphic patterns, clean lines, and fluid movement, drawing inspiration from pop art and Art Deco. \"Being in the studio, creating work, and seeing other artists bring their visions to life and give back to the community is the greatest gift,\" says Freeman. \"Creating a better world through the arts is really as good as it gets.\" In addition to his work with Sing for Hope, Freeman is a freelance illustrator, painter, and designer. He creates tour apparel for major pop acts with Live Nation, designs clothing and sneakers, and has editorial pieces featured in major publications such as Elle and Elle Korea.",
      "img": "patrick-freeman.jpg"
    },
    {
      "name": "Bridget Hogan",
      "title": "Sing for Hope Lab Manager",
      "bio": "In addition to a thriving studio, her work with young artists has brought her onto college faculties, conducting at churches throughout the US and Canada and working with youth choirs. As the former Managing Director of Opus 118 Harlem School of Music, and current Artistic Director of Reaching for the Arts, Ms. Hogan has designed curriculum to enable all young people access to high level arts education. She is thrilled to work with our Sing for Hope Youth Chorus as they bring joy to New York City everywhere from Moynihan Station and Brooklyn Cyclones games to the United Nations.",
      "img": "bridget-hogan.jpg"
    },
    {
      "name": "Victoria Donu",
      "title": "Sing for Hope Project Leader, Europe",
      "bio": "Sing for Hope Project Leader Victoria Donu is an artist and social entrepreneur born in Moldova and currently based in Czech Republic. She uses her voice to empower people and to raise awareness about social and cultural topics. Her versatility is reflected in her artistic journey spanning from youth choirs to jazz bands and solo performances across Europe. Victoria joined SFH in 2022 alongside Peter Herr to lead workshops and co-create new Sing for Hope Pianos with Ukrainian refugee youth and families as part of Sing for Hope’s Creative Hope for Refugees program. The program supports mental health and migration integration by fostering safe environments and creative art activities that uplift and support refugee communities. Starting in Nuremberg in March 2022, Victoria and Peter have since expanded the program to sites in Bucharest, Chișinău, Prague, and Turin (the latter in partnership with Sermig Arsenal of Peace), and will add 5 more European cities over the next year. A speaker at the 2022 Global Social Business Summit, Victoria is a strong advocate of the healing power of the arts, and of role of artists as compelling catalysts for positive change.",
      "img": "victoria-donu.jpg"
    },
    {
      "name": "Alex Garfin",
      "title": "Sing for Hope Youth Ambassador",
      "bio": "Born in 2003, New York City native Alex Garfin is a LaGuardia Drama alum and actor/musician widely known for his current role as “Jordan Kent” on Superman And Lois, “Linus Van Pelt” on The Peanuts Movie, and his stage work as “Jamie” in Fear at The Lucille Lortel Theater. Alex spent his childhood years playing on Sing for Hope Pianos at Lincoln Center Plaza and across the city. He became officially involved with the organization in 2021, performing his dedicated original song with the Sing for Hope Youth Chorus at the annual SFH Pianos Kickoff event at 28 Liberty Plaza, and later joining the organization for performances and creative activations at The United Nations. He also introduced the current partnership with the New York Mets. An avid advocate for his generation, Alex has spoken at Cop-27 in Egypt on growing intergenerational miscommunication and its effect on the climate crisis, and participated in negotiations with world leaders regarding this on behalf of the UNGSF. He is the co-founder of WeTheFuture.",
      "img": "alex-garfin.jpg"
    },
    {
      "name": "Peter Herr",
      "title": "Sing for Hope Project Leader, Europe",
      "bio": "Sing for Hope Project Leader Peter Herr (a.k.a. Momoshi) was born in Hungary, and raised in Africa, Germany, and Spain. He has worked as an artist since the early 2000‘s, with a focus on multimedia and dynamic public art. Selected highlights include Momoshi Style Hostel (City Hostel Nuremberg-Fuerth, Germany); daily digital artwork project Momoshidrops; murals for Art Museum Kumudori in Wemding; animation (Momoshi Space Race) for Glanzlichter Festival, Fuerth/ Germany; Sing for Hope Piano in Wolfsburg, Autostadt for the Global Social Business Summit; “Kiss Me“ murals in Spain and Germany; virtual reality designs and applications for market research company GFK; Momoshi Streetwear; and more. Peter first joined SFH in 2018 via our Grameen Creative Lab partnership and our SFH Piano program at the Global Social Business Summit. Today, as Sing for Hope Project Leader for Europe, Peter guides Sing for Hope’s dynamic arts activations that uplift and support refugee youth, with current focus on children and families forced to flee their homes by the war in Ukraine.",
      "img": "peter-herr.jpg"
    },
    {
      "name": "Genevieve Quarshie",
      "title": "Sing for Hope Project Leader, Africa",
      "bio": "Genevieve Quarshie is a dedicated fashion designer and humanitarian from Ghana, committed to uplifting her community and advocating for those in need. As the current project coordinator for the NGO Ghanahilfe, she has devoted her career to making a Genevieve is a powerful voice for the voiceless, channeling her passion into projects that empower individuals through skill training in fashion design, interior design, project management, and hair styling. In her latest endeavor, Genevieve launched an after-school program to support the personal growth and development of children in her community. Her work is rooted in the belief that empowering others to embrace their unique talents can lead to a stronger, more self-sufficient community. Genevieve’s partnership with Sing for Hope has seen her bring transformative projects to Life: Co-initiator and Co-organizer of the First Sing for Hope Piano in Ghana (2023): Genevieve led the introduction of Sing for Hope’s global piano initiative to Ghana, inspiring creative expression within her community. Costume Designer for the Sing for Hope Musical in India (May 2024): She designed all the costumes for the musical held at the Shanti Bhavan school in Bangalore, India, demonstrating her artistry on an international platform. Sing for Hope Representative in Kenya: Genevieve represented Sing for Hope in Kenya’s Maasai village, Mile46, furthering the organization’s mission to use the arts as a tool for connection and empowerment across borders. Genevieve continues to inspire and empower through her work, creating opportunities for growth and expression, while helping build resilient and creative communities. ",
      "img": "genevieve-quarshie.jpg"
    },
    {
      "name": "Debra Stern",
      "title": "Curriculum Consultant",
      "bio": "Debra Stern is the Founder and Executive Director of the Amani Public Charter School in Mount Vernon, NY.  She attended New Rochelle Public School, then earned a BS from Cornell University, an MS from The College of New Rochelle, an ED.M from Teachers College, Columbia University, and an MSW from New York University. She is presently pursuing a Doctor of Education in Education Policy and Leadership at American University.  For many years, Debra was an active volunteer in the Mount Vernon Community, serving as a member of the Mount Vernon Public Library Board of Trustees.  She also served as the Founding President of the Mount Vernon Public Library Foundation. Additionally, she was active in the PTA serving as the President of the PTA Council for two years. She is also a long-time member and leader of Mocha Moms, a support group for mothers of color in their parenting journey. In Pelham, Debra has been a past member of the Pelham Education Foundation and serves on the Board of Education's Cultural Competence Committee. She is active with her Alma Mater - Cornell University - presently serving as Vice-Chair of the Cornell University Council. Prior to taking time off to raise her family, and before founding Amani, Debra worked for many years in Higher Education Administration at College of New Rochelle, where she was the Assistant Director of Student Activities, and at Barnard College, where she was the Associate Director of Residential Life and later the Director of Pre-College Programs.  For many years, she worked in academia as an Adjunct Professor in Social Work at Concordia College. Debra is a lifelong Westchester resident. She and her husband Charles live in Pelham, NY, with their three children.",
      "img": "debra-stern.jpg"
    },
    {
      "name": "Fabio Tedde",
      "title": "Sing for Hope Project Leader, Europe",
      "bio": "Fabio Tedde or \"Pianist Without Borders\" is an Italian-born Pianist & Composer based in London U.K. since 2001. Fabio was musically inspired from a very young age. His formative years were spent watching and learning from his father Mario Tedde, a renowned pianist and accomplished composer, on the picturesque island of Sardinia. Fabio’s appetite and passion for world music fuelled his worldwide travels and he often found himself in far-away lands completely immersed in their musical styles and culture. Fabio has attracted public attention thanks to his ability to improvise on the spot, His music reflects his encounters with cultures around the world. As a soloist, Fabio toured the World performing on 1103 Public Pianos, hundreds of Sing For Hope Pianos in NYC, New Orleans & Kenya, as well many others public pianos provided by different organizations in various states throughout USA & Throughout many European countries including United kingdom, Italy, Germany, Belgium, Ireland, The Netherlands, Hungary, Luxembourg, Scotland, Cyprus, Switzerland & France, Fabio also worked as a volunteer in many humanitarian projects with Refugees, people with Albinism, children with Autism and so on Throughout Africa including South Africa, Burkina Faso, Ghana, Senegal, Mali, Egypt, Uganda, Kenya, Rwanda & Tanzania.",
      "img": "fabio-tedde.jpg"
    }
  ]
}
